backend/app/Controllers/Admin/AdminController.php

SELECT *
FROM `usuarios`
WHERE `token` = '84a78cc4f70084b046a425f58606432c600eaabcd65bad2bb7351490e82f2211'
 LIMIT 1
---
    public function index()
    {



        if (session()->get('logged') && session()->get('rol') === 'admin') {
            return $this->cargarView();
        }



        $tokenSesion = $this->request->getGet("tkn");

        if (empty($tokenSesion)) {
            dd("Error: El token no llega por la URL (tkn está vacío)");
        }

        $usuariosModel = new UsuariosModel();

        // Buscar usuario por token (ajusta el campo si es distinto)
        $usuario = $usuariosModel
            ->where('token', $tokenSesion)
            ->first();

SELECT *
FROM `usuarios`
SELECT *
FROM `matches`
---
    function cargarView()
    {
        $usuariosModel = new UsuariosModel();
        $inmueblesModel = new InmueblesModel();
        $matchesModel = new MatchesModel();

        $data = [
            'usuarios' => $usuariosModel->findAll(),
            'inmuebles' => $inmueblesModel->getInmuebles(),
            'matches' => $matchesModel->findAll()
        ];