backend/app/Controllers/Admin/InmueblesControllerA.php

SELECT *
FROM `inmuebles`
WHERE `inmuebles`.`id` = '2'
---
    public function editar($id = null)
{
    $inmueblesModel = new InmueblesModel();
    $uniModel = new UniversidadesModel();

    $inmueble = $inmueblesModel->find($id);