backend/app/Models/CarrerasModel.php

SELECT *
FROM `carreras`
---
    public function getCarreras($id = null)
{
    if ($id === null) {
        return $this->findAll();