backend/app/Models/InmueblesModel.php

    public function getInmueblesConDetalles()
    {
        return $this->select('inmuebles.*, usuarios.nombre as propietario, universidades.nombre as universidad')
            ->join('usuarios', 'usuarios.id = inmuebles.propietario_id')
            ->join('universidades', 'universidades.id = inmuebles.universidad_id')
            ->findAll();
---
SELECT `inmuebles`.*, `u_prop`.`nombre` as `nombre_propietario`, `universidades`.`nombre` as `nombre_universidad`, `u_est`.`id` as `est_id`, `u_est`.`nombre` as `est_nombre`
FROM `inmuebles`
LEFT JOIN `usuarios` as `u_prop` ON `u_prop`.`id` = `inmuebles`.`propietario_id`
LEFT JOIN `universidades` ON `universidades`.`id` = `inmuebles`.`universidad_id`
LEFT JOIN `matches` ON `matches`.`inmueble_id` = `inmuebles`.`id`
LEFT JOIN `usuarios` as `u_est` ON `u_est`.`id` = `matches`.`estudiante_id`
WHERE inmuebles.id NOT IN (SELECT inmueble_id FROM solicitudes WHERE estudiante_id = 10)
ORDER BY RAND()

    public function getInmuebleDetalle($id = null)
    {
        // Seleccionamo inmueble con el id,traemos el propietario y la universidad
        $this->select('inmuebles.*');
        $this->select('u_prop.nombre as nombre_propietario');
        $this->select('universidades.nombre as nombre_universidad');

        $this->join(
            'usuarios as u_prop',
            'u_prop.id = inmuebles.propietario_id',
            'left'
        );

        $this->join(
            'universidades',
            'universidades.id = inmuebles.universidad_id',
            'left'
        );

        $inmueble = $this->find($id);

        $db = \Config\Database::connect();

        // Traemos las solicitudes,con el nombre de los usuarios que han solicitado ese piso


        $solicitudes = $db->table('solicitudes')
            ->select('solicitudes.*')
            ->select('u_sol.nombre as nombre_solicitante, u_sol.foto_perfil')
            ->join(
                'usuarios as u_sol',
                'u_sol.id = solicitudes.estudiante_id',
                'left'
            )
            ->where('solicitudes.inmueble_id', $id)
            ->get()
            ->getResultArray();
---
SELECT `solicitudes`.*, `u_sol`.`nombre` as `nombre_solicitante`, `u_sol`.`foto_perfil`
FROM `solicitudes`
LEFT JOIN `usuarios` as `u_sol` ON `u_sol`.`id` = `solicitudes`.`estudiante_id`
WHERE `solicitudes`.`inmueble_id` = '21'


        // Traemos los mathes,con el nombre de los usuarios que han hecho match con ese piso

        $matches = $db->table('matches')
            ->select('matches.*')
            ->select('u_est.nombre as nombre_estudiante, u_est.foto_perfil')
            ->join(
                'usuarios as u_est',
                'u_est.id = matches.estudiante_id',
                'left'
            )
            ->where('matches.inmueble_id', $id)
            ->get()
            ->getResultArray();
---
SELECT `matches`.*, `u_est`.`nombre` as `nombre_estudiante`, `u_est`.`foto_perfil`
FROM `matches`
LEFT JOIN `usuarios` as `u_est` ON `u_est`.`id` = `matches`.`estudiante_id`
WHERE `matches`.`inmueble_id` = '21'

    public function getInmueblesPropietario($id)
    {
        return $this->select('inmuebles.*')
            ->where('inmuebles.propietario_id', $id)
            ->orderBy('inmuebles.id', 'DESC')
            ->findAll();
---
SELECT `inmuebles`.*
FROM `inmuebles`
WHERE `inmuebles`.`propietario_id` = '7'