backend/app/Models/InmueblesModel.php

    public function getInmueblesConDetalles()
    {
        return $this->select('inmuebles.*, usuarios.nombre as propietario, universidades.nombre as universidad')
            ->join('usuarios', 'usuarios.id = inmuebles.propietario_id')
            ->join('universidades', 'universidades.id = inmuebles.universidad_id')
            ->findAll();
---
SELECT `inmuebles`.*, `u_prop`.`nombre` as `nombre_propietario`, `universidades`.`nombre` as `nombre_universidad`, `u_est`.`id` as `est_id`, `u_est`.`nombre` as `est_nombre`
FROM `inmuebles`
LEFT JOIN `usuarios` as `u_prop` ON `u_prop`.`id` = `inmuebles`.`propietario_id`
LEFT JOIN `universidades` ON `universidades`.`id` = `inmuebles`.`universidad_id`
LEFT JOIN `matches` ON `matches`.`inmueble_id` = `inmuebles`.`id`
LEFT JOIN `usuarios` as `u_est` ON `u_est`.`id` = `matches`.`estudiante_id`
WHERE inmuebles.id NOT IN (SELECT inmueble_id FROM solicitudes WHERE estudiante_id = 10)
ORDER BY RAND()