backend/app/Models/UniversidadesModel.php

SELECT *
FROM `universidades`
---
    public function getUniversidades($id = null)
{
    if ($id === null) {
        return $this->findAll();