backend/app/Models/UsuariosModel.php

    public function getUsuarios($id = null)
    {

        if ($id === null) {
            $sql = $this->select('usuarios.*');
            $sql = $this->findAll();
            return $sql;
        }

        $sql = $this->select(
            "usuarios.*,
        carreras.nombre AS nombre_carrera,
        universidades.nombre AS nombre_universidad,
        GROUP_CONCAT(CONCAT(atributos.nombre, '|', atributos.icono) SEPARATOR ';') AS atributos_usuario"
        );
        $sql = $this->join('carreras', 'carreras.id = usuarios.id_carrera', 'left');
        $sql = $this->join('universidades', 'universidades.id = usuarios.universidad_id', 'left');
        $sql = $this->join('usuario_atributos', 'usuario_atributos.usuario_id = usuarios.id', 'left');
        $sql = $this->join('atributos', 'atributos.id = usuario_atributos.atributo_id', 'left');
        $sql = $this->where('usuarios.id', $id);
        $sql = $this->groupBy('usuarios.id');
        $sql = $this->first();
---
SELECT `usuarios`.*, `carreras`.`nombre` AS `nombre_carrera`, `universidades`.`nombre` AS `nombre_universidad`, GROUP_CONCAT(CONCAT(atributos.nombre, '|', atributos.icono) SEPARATOR ';') AS atributos_usuario
FROM `usuarios`
LEFT JOIN `carreras` ON `carreras`.`id` = `usuarios`.`id_carrera`
LEFT JOIN `universidades` ON `universidades`.`id` = `usuarios`.`universidad_id`
LEFT JOIN `usuario_atributos` ON `usuario_atributos`.`usuario_id` = `usuarios`.`id`
LEFT JOIN `atributos` ON `atributos`.`id` = `usuario_atributos`.`atributo_id`
WHERE `usuarios`.`id` = '19'
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1