backend/app/Controllers/InmueblesController.php

SELECT *
FROM `usuarios`
WHERE `token` = '7c3a879df861bab12203c9d74cf789a7f6a418deb00b594ed852a1d757dab961'
 LIMIT 1
---
    public function inmueblesLista()
    {

        $token = $this->request->getHeaderLine('X-API-TOKEN');
        $usuarioModel = new UsuariosModel();

        $usuarioSesion = $usuarioModel->where('token', $token)
            ->first();

SELECT *
FROM `usuarios`
WHERE `token` = '46f237dba78b5a49fbae760e36fea28f9cc7a1174b3c7b08479046a46af145b4'
 LIMIT 1
---
    public function inmueblesFiltradoUniversidad()
    {

        $token = $this->request->getHeaderLine('X-API-TOKEN');
        $usuarioModel = new UsuariosModel();

        $usuarioSesion = $usuarioModel->where('token', $token)
            ->first();

SELECT *
FROM `usuarios`
WHERE `token` = '7c3a879df861bab12203c9d74cf789a7f6a418deb00b594ed852a1d757dab961'
 LIMIT 1
---
    public function inmueblesListaAleatoria()
    {

        $modelInmueble = new InmueblesModel();

        $token = $this->request->getHeaderLine('X-API-TOKEN');
        $usuarioModel = new UsuariosModel();

        $usuarioSesion = $usuarioModel->where('token', $token)
            ->first();