backend/app/Controllers/UsuariosController.php

SELECT *
FROM `usuarios`
WHERE `token` = 'e23c63cdbb3ecd579f1937f7bbff77487d61a3bb50fcf20f66f2a90f621d9724'
 LIMIT 1
---
    public function setAtributos()
    {
        $token = $this->request->getHeaderLine('X-API-TOKEN');
        $userData = $this->request->getJSON();




        if (!$userData) {
            return $this->fail('No se han seleccionado atributos', 400);
        }
        $usuarioModel = new UsuariosModel();
        $usuario = $usuarioModel->where('token', $token)
            ->first();

SELECT *
FROM `usuarios`
WHERE `token` = 'f4d7005042806e8fef5cdf82804a856f56825034d96f4775123ff12426256e2c'
 LIMIT 1
---
    public function solicitudesUsuario()
    {


        $token = $this->request->getHeaderLine('X-API-TOKEN');
        $model = new UsuariosModel();
        $sesionActiva = $model->where('token', $token)
            ->first();