backend/app/Controllers/UsuariosController.php

SELECT *
FROM `usuarios`
WHERE `token` = 'ad18de71c68e88075c6a1c93cd13bcf9fedb346e1fbe72e958fd3cdb11cd0e60'
 LIMIT 1
---
    public function solicitudesUsuario()
    {


        $token = $this->request->getHeaderLine('X-API-TOKEN');
        $model = new UsuariosModel();
        $sesionActiva = $model->where('token', $token)
            ->first();

SELECT *
FROM `usuarios`
WHERE `token` = '5ebd97775df5819dc89c4673e2e539ed9461157ffa2ca2d0726737e282a32f88'
 LIMIT 1
---
    public function getPerfilUsuario($id = null)
    {


        $token = $this->request->getHeaderLine('X-API-TOKEN');
        $model = new UsuariosModel();



        $sesionActiva = $model->where('token', $token)
            ->first();